#### Q8: Join the data frames car-owners.csv and car-models.csv using all the join types

In [1]:
#import pandas library
import pandas as pd

In [2]:
#reading the csv files
owners_df = pd.read_csv('car-owners.csv')
models_df = pd.read_csv('car-models.csv')

In [3]:
owners_df, models_df

(              car             name
 0      Fiat Punto   Michael Forbes
 1         Mazda 6    Jane Clifford
 2     Ford Fiesta        Mary Wing
 3  Renault Twingo   Thomas Johnson
 4   Skoda Octavia    Andrew Parker
 5    Suzuki Swift  Lilian Morrison,
               car  horsepower  mpg
 0         Mazda 6         184   28
 1    Suzuki Swift         101  113
 2    Honda Accord         252   30
 3     Ford Fiesta         120   41
 4  Renault Twingo          90   66
 5      Fiat Punto          72   44
 6    BMW 5 series         456   25)

##### INNER JOIN

In [4]:
inner_join_df = pd.merge(owners_df, models_df, on= 'car', how= 'inner')
inner_join_df

              car             name  horsepower  mpg
0      Fiat Punto   Michael Forbes          72   44
1         Mazda 6    Jane Clifford         184   28
2     Ford Fiesta        Mary Wing         120   41
3  Renault Twingo   Thomas Johnson          90   66
4    Suzuki Swift  Lilian Morrison         101  113

COMMENT: This is the default type of join in pandas. It combines the two data frames based on matching values in the specified column(s), and includes only the rows that have a match in both data frames.

##### LEFT JOIN

In [5]:
left_join_df = pd.merge(owners_df, models_df, on= 'car', how= 'left')
left_join_df

              car             name  horsepower    mpg
0      Fiat Punto   Michael Forbes        72.0   44.0
1         Mazda 6    Jane Clifford       184.0   28.0
2     Ford Fiesta        Mary Wing       120.0   41.0
3  Renault Twingo   Thomas Johnson        90.0   66.0
4   Skoda Octavia    Andrew Parker         NaN    NaN
5    Suzuki Swift  Lilian Morrison       101.0  113.0

COMMENT: This type of join includes all rows from the left data frame, and only the matching rows from the right data frame.

##### RIGHT JOIN

In [6]:
right_join_df = pd.merge(owners_df, models_df, on= 'car', how= 'right')
right_join_df

              car             name  horsepower  mpg
0         Mazda 6    Jane Clifford         184   28
1    Suzuki Swift  Lilian Morrison         101  113
2    Honda Accord              NaN         252   30
3     Ford Fiesta        Mary Wing         120   41
4  Renault Twingo   Thomas Johnson          90   66
5      Fiat Punto   Michael Forbes          72   44
6    BMW 5 series              NaN         456   25

COMMENT: This type of join includes all rows from the right data frame, and only the matching rows from the left data frame.

##### FULL JOIN

In [7]:
full_join_df = pd.merge(owners_df, models_df, on= 'car', how = 'outer')
full_join_df.head()

              car             name  horsepower    mpg
0      Fiat Punto   Michael Forbes        72.0   44.0
1         Mazda 6    Jane Clifford       184.0   28.0
2     Ford Fiesta        Mary Wing       120.0   41.0
3  Renault Twingo   Thomas Johnson        90.0   66.0
4   Skoda Octavia    Andrew Parker         NaN    NaN
5    Suzuki Swift  Lilian Morrison       101.0  113.0
6    Honda Accord              NaN       252.0   30.0
7    BMW 5 series              NaN       456.0   25.0

COMMENT: This type of join includes all rows from both data frames, filling in missing values with NaN where there is no match.